In [ ]:
import pandas as pd
data = {
    	'Name': ['Alice', 'Bob', 'Charlie'],
   	    'Age': [25, 30, 35],
	    'Salary': [50000, 60000, 75000]
	}
df = pd.DataFrame(data)
print(df.head(1)) # default n= 5

    Name  Age  Salary
0  Alice   25   50000

In [3]:
import pandas as pd
data = {
    	'Name': ['Alice', 'Bob', 'Charlie'],
   	    'Age': [25, 30, 35],
	    'Salary': [50000, 60000, 75000]
	}
df = pd.DataFrame(data)
print(df.tail(1))

      Name  Age  Salary
2  Charlie   35   75000

In [4]:
import pandas as pd
data = {
    	'Name': ['Alice', 'Bob', 'Charlie'],
   	    'Age': [25, 30, 35],
	    'Salary': [50000, 60000, 75000]
	}
df = pd.DataFrame(data)
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [5]:
import pandas as pd
data = {
    	'Name': ['Alice', 'Bob', 'Charlie'],
   	    'Age': [25, 30, 35],
	    'Salary': [50000, 60000, 75000]
	}
df = pd.DataFrame(data)
print(df.describe())

        Age        Salary
count   3.0      3.000000
mean   30.0  61666.666667
std     5.0  12583.057392
min    25.0  50000.000000
25%    27.5  55000.000000
50%    30.0  60000.000000
75%    32.5  67500.000000
max    35.0  75000.000000

In [ ]:
import pandas as pd
data = {
    	'Name': ['Alice', 'Bob', 'Charlie'],
   	    'Age': [25, 30, 35],
	    'Salary': [50000, 60000, 75000]
	}
df = pd.DataFrame(data)
print(df.info())

In [12]:
import pandas as pd
data = {
    	'Name': ['Alice', 'Bob', 'Charlie','BOb'],
   	    'Age': [25, 30, 35,30],
	    'Salary': [50000, 60000, 75000,60000]
	}
df = pd.DataFrame(data)
print(df.set_index('Name').value_counts())
print(df)

Age  Salary
30   60000     2
25   50000     1
35   75000     1
Name: count, dtype: int64
      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   75000
3      BOb   30   60000

In [17]:
import pandas as pd
data = {
    	'Name': ['Alice', 'Bob', 'Charlie','BOb'],
   	    'Age': [25, 30, 35,30],
	    'Salary': [50000, 60000, 75000,60000]
	}
df = pd.DataFrame(data)
df.to_csv('output.csv',index=False)

In [18]:
df = pd.read_csv('output.csv')
print(df)

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   75000
3      BOb   30   60000

In [22]:
import pandas as pd
data = {
    	'Name': ['Alice', 'Bob', 'Charlie','BOb'],
   	    'Age': [25, 30, 35,30],
	    'Salary': [50000, 60000, 75000,60000]
	}
df = pd.DataFrame(data)
df.to_excel('output.xlsx',index=False)

In [23]:
df = pd.read_excel('output.xlsx')
print(df)

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   75000
3      BOb   30   60000

In [26]:
import pandas as pd
data = {
    	'Name': ['Alice', 'Bob', 'Charlie'],
   	    'Age': [25, 30, 35],
	    'Salary': [50000, 60000, 75000]
	}
df = pd.DataFrame(data)
print(df.loc[df['Age']>=30,['Salary','Name']])

   Salary     Name
1   60000      Bob
2   75000  Charlie

In [30]:
import pandas as pd
data = {
    	'Name': ['Alice', 'Bob', 'Charlie'],
   	    'Age': [25, 30, 35],
	    'Salary': [50000, 60000, 75000]
	}
df = pd.DataFrame(data)
print(df.iloc[0:2,0:1])

    Name
0  Alice
1    Bob

In [34]:
import pandas as pd
data = {
    	'Name': ['Alice', 'Bob', 'Charlie'],
   	    'Age': [25, 30, 35],
	    'Salary': [50000, 60000, 75000]
	}
df = pd.DataFrame(data)
print(df.at[0,'Age'])

25

In [36]:
import pandas as pd
data = {
    	'Name': ['Alice', 'Bob', 'Charlie'],
   	    'Age': [25, 30, 35],
	    'Salary': [50000, 60000, 75000]
	}
df = pd.DataFrame(data)
print(df)
print(df.iat[0,2])  # iat[row_index,column_index]

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   75000
50000

In [4]:
import pandas as pd
data = {
    	'Name': ['Alice', 'Bob', 'Charlie'],
 	 'Age': [25, 30, 35],
	 'Salary': [50000, 60000, 75000]
	}
df = pd.DataFrame(data)
print(df.query('Age>30 or Salary>80000'))

      Name  Age  Salary
2  Charlie   35   75000

In [9]:
import pandas as pd
data = {
    	'Name': ['Alice', 'Bob', 'Charlie'],
 	 'Age': [25, 30, 35],
	 'Salary': [50000, 60000, 75000]
	}
df = pd.DataFrame(data)
print(df)
print(df.filter(items=[1], axis=0))

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   75000
  Name  Age  Salary
1  Bob   30   60000

In [20]:
import pandas as pd
import numpy as np
data = {
    	    'Name': ['Alice', 'Bob', 'Charlie'],
   	        'Age': [25, 30,np.nan],
	        'Salary': [50000, 60000, 75000]
	}
df = pd.DataFrame(data)
print(df)
# df.info()
print(df.select_dtypes(include=['object','float'],exclude=int))

      Name   Age  Salary
0    Alice  25.0   50000
1      Bob  30.0   60000
2  Charlie   NaN   75000
      Name   Age
0    Alice  25.0
1      Bob  30.0
2  Charlie   NaN

In [30]:
import pandas as pd
data = {
    	'Name': ['Alice', 'Bob', 'Charlie', 'Alice', 'Bob'],
    	'Age': [25, 30, 35, 25, 30],
    	'Salary': [50000, 60000, 70000, 50000, 70000]
} 
df = pd.DataFrame(data);print(df)
print(df.duplicated( keep=False))

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   70000
3    Alice   25   50000
4      Bob   30   70000
0     True
1    False
2    False
3     True
4    False
dtype: bool

In [36]:
import pandas as pd
data = {
    	'Name': ['Alice', 'Bob', 'Charlie', 'Alice', 'Bob'],
    	'Age': [25, 30, 35, 25, 30],
    	'Salary': [50000, 60000, 70000, 50000, 70000]
} 
df = pd.DataFrame(data)
print(df)
print(df.drop_duplicates( keep=False,ignore_index=True,inplace=True))
print(df)

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   70000
3    Alice   25   50000
4      Bob   30   70000
None
      Name  Age  Salary
0      Bob   30   60000
1  Charlie   35   70000
2      Bob   30   70000

In [48]:
import pandas as pd
data = {
    	'Name': ['Alice', 'Bob', 'Charlie', 'Alice', 'Bob'],
    	'Age': [20, 30, 35, 25, 30],
    	'Salary': [50000, 60000, 70000, 50000, 70000]
} 
df = pd.DataFrame(data)
print(df)
df2 = df.copy(deep=True)
print(df2)
df2.insert(1,'abc','xyz')
print(df2)
print(df)

      Name  Age  Salary
0    Alice   20   50000
1      Bob   30   60000
2  Charlie   35   70000
3    Alice   25   50000
4      Bob   30   70000
      Name  Age  Salary
0    Alice   20   50000
1      Bob   30   60000
2  Charlie   35   70000
3    Alice   25   50000
4      Bob   30   70000
      Name  abc  Age  Salary
0    Alice  xyz   20   50000
1      Bob  xyz   30   60000
2  Charlie  xyz   35   70000
3    Alice  xyz   25   50000
4      Bob  xyz   30   70000
      Name  Age  Salary
0    Alice   20   50000
1      Bob   30   60000
2  Charlie   35   70000
3    Alice   25   50000
4      Bob   30   70000

In [44]:
df2 = df.copy(deep=False)
df2 = df2.insert(1,'abc','xyz')
print(df2)

None

In [55]:
import pandas as pd
data = {
    	'Name': ['Alice', 'Bob', 'Charlie', 'Alice', 'Bob'],
    	'Age': [20, 30, 35, 25, 30],
    	'Salary': [50000, 60000, 70000, 50000, 70000]
} 
df = pd.DataFrame(data)
print(df)
print(df.assign(num=123))

      Name  Age  Salary
0    Alice   20   50000
1      Bob   30   60000
2  Charlie   35   70000
3    Alice   25   50000
4      Bob   30   70000
      Name  Age  Salary  num
0    Alice   20   50000  123
1      Bob   30   60000  123
2  Charlie   35   70000  123
3    Alice   25   50000  123
4      Bob   30   70000  123

In [57]:
import pandas as pd
data = {
    	'Name': ['Alice', 'Bob', 'Charlie', 'Alice', 'Bob'],
    	'Age': [20, 30, 35, 25, 30],
    	'Salary': [50000, 60000, 70000, 50000, 70000]
} 
df = pd.DataFrame(data)
print(df)
df.insert(1,'num',123,allow_duplicates=True)
print(df)

      Name  Age  Salary
0    Alice   20   50000
1      Bob   30   60000
2  Charlie   35   70000
3    Alice   25   50000
4      Bob   30   70000
      Name  num  Age  Salary
0    Alice  123   20   50000
1      Bob  123   30   60000
2  Charlie  123   35   70000
3    Alice  123   25   50000
4      Bob  123   30   70000

In [1]:
import pandas as pd
data = {
    	'Name': ['Alice', 'Bob', 'Charlie', 'Alice', 'Bob'],
    	'Age': [20, 30, 35, 25, 30],
    	'Salary': [50000, 60000, 70000, 50000, 70000]
} 
df = pd.DataFrame(data)
print(df)
df.insert(1,'num',123,allow_duplicates=True)
print(df)
print(df.pop('Age'))
print(df)

      Name  Age  Salary
0    Alice   20   50000
1      Bob   30   60000
2  Charlie   35   70000
3    Alice   25   50000
4      Bob   30   70000
      Name  num  Age  Salary
0    Alice  123   20   50000
1      Bob  123   30   60000
2  Charlie  123   35   70000
3    Alice  123   25   50000
4      Bob  123   30   70000
0    20
1    30
2    35
3    25
4    30
Name: Age, dtype: int64
      Name  num  Salary
0    Alice  123   50000
1      Bob  123   60000
2  Charlie  123   70000
3    Alice  123   50000
4      Bob  123   70000

In [21]:
import pandas as pd
data = {
    	'Name': ['Alice', 'Bob', 'Charlie', 'Alice', 'Bob'],
    	'Age': [20, 30, 35, 25, 30],
    	'Salary': [50000, 60000, 70000, 50000, 70000]
} 
df = pd.DataFrame(data)
print(df)

      Name  Age  Salary
0    Alice   20   50000
1      Bob   30   60000
2  Charlie   35   70000
3    Alice   25   50000
4      Bob   30   70000

In [17]:
df.drop(0,axis=0,inplace= True)
df.reindex()
print("After drop\n",df)

After drop
       Name  Age  Salary
1      Bob   30   60000
2  Charlie   35   70000
3    Alice   25   50000
4      Bob   30   70000

In [ ]:
print(df.drop('Name',axis=1))

   Age  Salary
0   20   50000
1   30   60000
2   35   70000
3   25   50000
4   30   70000

In [23]:
print(df)

      Name  Age  Salary
0    Alice   20   50000
1      Bob   30   60000
2  Charlie   35   70000
3    Alice   25   50000
4      Bob   30   70000

In [26]:
import pandas as pd
data = {
    	'Name': ['Alice', 'Bob', 'Charlie', 'Alice', 'Bob'],
    	'Age': [20, 30, 35, 25, 30],
    	'Salary': [50000, 60000, 70000, 50000, 70000]
} 
df = pd.DataFrame(data)
print(df)

      Name  Age  Salary
0    Alice   20   50000
1      Bob   30   60000
2  Charlie   35   70000
3    Alice   25   50000
4      Bob   30   70000

In [ ]:
df.rename(columns={'Age':'age'},inplace=True)
print(df)
# df.rename(index={0:'age'},inplace=True)  # do not try this thing because all index is int 
# print(df)

        Name  age  Salary
age    Alice   20   50000
1        Bob   30   60000
2    Charlie   35   70000
3      Alice   25   50000
4        Bob   30   70000

In [29]:
print(df)

      Name  age  Salary
0    Alice   20   50000
1      Bob   30   60000
2  Charlie   35   70000
3    Alice   25   50000
4      Bob   30   70000

In [34]:
import pandas as pd
data = {
    	'Name': ['Alice', 'Bob', 'Charlie', 'Alice', 'bob'],
    	'Age': [20, 30, 35, 25, 30],
    	'Salary': [50000, 60000, 70000, 50000, 75000]
} 
df = pd.DataFrame(data)
print(df)
df.replace(30,10,inplace=True)
print(df)

      Name  Age  Salary
0    Alice   20   50000
1      Bob   30   60000
2  Charlie   35   70000
3    Alice   25   50000
4      bob   30   75000
      Name  Age  Salary
0    Alice   20   50000
1      Bob   10   60000
2  Charlie   35   70000
3    Alice   25   50000
4      bob   10   75000

In [ ]:
import pandas as pd
data = {
    	'Name': ['Alice', 'Bob', 'Charlie', 'Alice', 'bob'],
    	'Age': [20, 30, 35, 25, 30],
    	'Salary': [50000, 60000, 70000, 50000, 75000]
} 
df = pd.DataFrame(data)
print(df)
mask_df= df.mask(df['Age'] < 28,other='A')
print(mask_df)

      Name  Age  Salary
0    Alice   20   50000
1      Bob   30   60000
2  Charlie   35   70000
3    Alice   25   50000
4      bob   30   75000
      Name   Age   Salary
1      Bob  30.0  60000.0
2  Charlie  35.0  70000.0
4      bob  30.0  75000.0

In [6]:
import pandas as pd
import numpy as np
data = {
    	'Name': ['Alice', 'Bob', 'Charlie'],
 	 'Age': [25, 30, np.nan],
	 'Salary': [50000, 60000,np.nan]
	}
df = pd.DataFrame(data)
df['Age'].fillna(0,inplace=True)
print(df)
df.fillna(0.0001,inplace=True)
print(df)

      Name   Age   Salary
0    Alice  25.0  50000.0
1      Bob  30.0  60000.0
2  Charlie   0.0      NaN
      Name   Age      Salary
0    Alice  25.0  50000.0000
1      Bob  30.0  60000.0000
2  Charlie   0.0      0.0001

C:\Users\hello\AppData\Local\Temp\ipykernel_4696\1350509830.py:9: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(0,inplace=True)

In [12]:
import pandas as pd
import numpy as np
data = {
    	'Name': ['Alice', 'Bob', 'Charlie'],
 	 'Age': [25, 30, np.nan],
	 'Salary': [50000, np.nan, 75000]
	}
df = pd.DataFrame(data)
print(df)
df.dropna(axis=0,inplace=True)
print(df)

      Name   Age   Salary
0    Alice  25.0  50000.0
1      Bob  30.0      NaN
2  Charlie   NaN  75000.0
    Name   Age   Salary
0  Alice  25.0  50000.0

In [28]:
import pandas as pd
data = {
    	'Name': ['Alice', 'Bob', 'Charlie'],
 	'Age': [25, 30, 35],
	'Salary': [50000, 60000, 75000],
  	'City': ['New York', 'Chicago', 'Los Angeles']	
	}
df = pd.DataFrame(data)
print(df)
df=df.set_index('Name')
print(df)
df1=df.truncate(after='Age',axis=0)
print(df1)

      Name  Age  Salary         City
0    Alice   25   50000     New York
1      Bob   30   60000      Chicago
2  Charlie   35   75000  Los Angeles
         Age  Salary         City
Name
Alice     25   50000     New York
Bob       30   60000      Chicago
Charlie   35   75000  Los Angeles
Empty DataFrame
Columns: [Age, Salary, City]
Index: []

In [32]:
import pandas as pd
data = {
    	'Name': ['Alice', 'Bob', 'Charlie'],
 	'Age': [25, 30, 35],
	'Salary': [50000, 60000, 75000],
  	'City': ['New York', 'Chicago', 'Los Angeles']	
	}
df = pd.DataFrame(data)
print(df.dtypes)
print(df.convert_dtypes().dtypes)

Name      object
Age        int64
Salary     int64
City      object
dtype: object
Name      string[python]
Age                Int64
Salary             Int64
City      string[python]
dtype: object

In [42]:
import pandas as pd
import numpy as np
data = {
   	'Name': ['Alice', 'Bob', 'Charlie', 'Alice', 'Bob'],
    	'Age': [25, 30, 35, 25, np.nan],
    	'Salary': [50000, 60000, 70000, 60000, 70000]
	} 
df = pd.DataFrame(data)
print(df)
# print(df.sort_values('Age'))
multiple_sort = df.sort_values(['Age','Salary'],na_position='first')
print(multiple_sort)

      Name   Age  Salary
0    Alice  25.0   50000
1      Bob  30.0   60000
2  Charlie  35.0   70000
3    Alice  25.0   60000
4      Bob   NaN   70000
      Name   Age  Salary
4      Bob   NaN   70000
0    Alice  25.0   50000
3    Alice  25.0   60000
1      Bob  30.0   60000
2  Charlie  35.0   70000

In [45]:
import pandas as pd
data = {
    	'Name': ['Alice', 'Bob', 'Charlie', 'Alice', 'Bob'],
    	'Age': [25, 30, 35, 25, 30],
    	'Salary': [50000, 60000, 70000, 60000, 70000]
	} 
df = pd.DataFrame(data)
print(df)
df.sort_index(axis=1,inplace=True)
print(df)
df.set_index('Name',inplace=True)
df.sort_index(axis=0,inplace=True)
print(df)

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   70000
3    Alice   25   60000
4      Bob   30   70000
   Age     Name  Salary
0   25    Alice   50000
1   30      Bob   60000
2   35  Charlie   70000
3   25    Alice   60000
4   30      Bob   70000
         Age  Salary
Name
Alice     25   50000
Alice     25   60000
Bob       30   60000
Bob       30   70000
Charlie   35   70000